; domain
(define (domain p2)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    carrier_space
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (empty-space ?carrier - carrier ?space - carrier_space)
    (next ?numA - num ?numB - num) 
    (crate-at-space ?crate - crate ?carrier - carrier ?space - carrier_space) 
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (empty-space ?carrier ?carrier_space)           
    )
    :effect (and
        (not (empty-space ?carrier ?carrier_space))
        (crate-at-space ?crate ?carrier ?carrier_space)        
        (not (crate-at ?crate ?location))    
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?carrier_space - carrier_space
        ?person - person
        ?content - content 
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (crate-at-space ?crate ?carrier ?carrier_space)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
    )
    :effect (and
        (empty-space ?carrier ?carrier_space)
        (not (crate-at-space ?crate ?carrier ?carrier_space))        
        (has-content-person ?person ?content)   
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l22_p22_c22_g22_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	carrier1 - carrier
	space1 - carrier_space
	space2 - carrier_space
	space3 - carrier_space
	space4 - carrier_space
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
	N5 - num
	N6 - num
	N7 - num
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(crate-at crate12 depot)
	(crate-at crate13 depot)
	(crate-at crate14 depot)
	(crate-at crate15 depot)
	(crate-at crate16 depot)
	(crate-at crate17 depot)
	(crate-at crate18 depot)
	(crate-at crate19 depot)
	(crate-at crate20 depot)
	(crate-at crate21 depot)
	(crate-at crate22 depot)
	(carrier-at carrier1 depot)
	(empty-space carrier1 space1)
	(empty-space carrier1 space2)
	(empty-space carrier1 space3)
	(empty-space carrier1 space4)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate food crate8)
	(content-crate food crate9)
	(content-crate food crate10)
	(content-crate food crate11)
	(content-crate food crate12)
	(content-crate food crate13)
	(content-crate food crate14)
	(content-crate food crate15)
	(content-crate medicine crate16)
	(content-crate medicine crate17)
	(content-crate medicine crate18)
	(content-crate medicine crate19)
	(content-crate medicine crate20)
	(content-crate medicine crate21)
	(content-crate medicine crate22)
	(person-at person1 loc9)
	(person-at person2 loc9)
	(person-at person3 loc19)
	(person-at person4 loc5)
	(person-at person5 loc1)
	(person-at person6 loc10)
	(person-at person7 loc9)
	(person-at person8 loc16)
	(person-at person9 loc13)
	(person-at person10 loc10)
	(person-at person11 loc7)
	(person-at person12 loc18)
	(person-at person13 loc14)
	(person-at person14 loc13)
	(person-at person15 loc19)
	(person-at person16 loc12)
	(person-at person17 loc6)
	(person-at person18 loc10)
	(person-at person19 loc9)
	(person-at person20 loc15)
	(person-at person21 loc16)
	(person-at person22 loc13)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person5 medicine)
	(has-content-person person7 food)
	(has-content-person person8 food)
	(has-content-person person9 food)
	(has-content-person person9 medicine)
	(has-content-person person10 food)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person12 food)
	(has-content-person person12 medicine)
	(has-content-person person13 medicine)
	(has-content-person person14 food)
	(has-content-person person15 food)
	(has-content-person person15 medicine)
	(has-content-person person16 food)
	(has-content-person person18 food)
	(has-content-person person19 food)
	(has-content-person person20 food)
	(has-content-person person21 food)
	(has-content-person person22 food)
))
)

; plan
1. (put-crate-in-carrier crate22 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate22 depot)
   added: (crate-at-space crate22 carrier1 space4)
   goals met: 1 of 23
2. (put-crate-in-carrier crate15 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate15 depot)
   added: (crate-at-space crate15 carrier1 space3)
   goals met: 1 of 23
3. (move-carrier depot loc15 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   goals met: 0 of 23
4. (pick-and-drop crate15 loc15 drone1 carrier1 space3 person20 food)
   deleted: (crate-at-space crate15 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person20 food)
   goals met: 1 of 23
5. (move-carrier loc15 depot drone1 carrier1)
   deleted: (drone-at drone1 loc15) (carrier-at carrier1 loc15)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 2 of 23
6. (put-crate-in-carrier crate14 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate14 depot)
   added: (crate-at-space crate14 carrier1 space3)
   goals met: 2 of 23
7. (move-carrier depot loc14 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   goals met: 1 of 23
8. (pick-and-drop crate22 loc14 drone1 carrier1 space4 person13 medicine)
   deleted: (crate-at-space crate22 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person13 medicine)
   goals met: 2 of 23
9. (move-carrier loc14 depot drone1 carrier1)
   deleted: (drone-at drone1 loc14) (carrier-at carrier1 loc14)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 23
10. (put-crate-in-carrier crate21 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate21 depot)
   added: (crate-at-space crate21 carrier1 space4)
   goals met: 3 of 23
11. (move-carrier depot loc12 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   goals met: 2 of 23
12. (pick-and-drop crate14 loc12 drone1 carrier1 space3 person16 food)
   deleted: (crate-at-space crate14 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person16 food)
   goals met: 3 of 23
13. (move-carrier loc12 depot drone1 carrier1)
   deleted: (drone-at drone1 loc12) (carrier-at carrier1 loc12)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 23
14. (put-crate-in-carrier crate13 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate13 depot)
   added: (crate-at-space crate13 carrier1 space3)
   goals met: 4 of 23
15. (move-carrier depot loc7 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   goals met: 3 of 23
16. (pick-and-drop crate13 loc7 drone1 carrier1 space3 person11 food)
   deleted: (crate-at-space crate13 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person11 food)
   goals met: 4 of 23
17. (move-carrier loc7 depot drone1 carrier1)
   deleted: (drone-at drone1 loc7) (carrier-at carrier1 loc7)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 23
18. (put-crate-in-carrier crate12 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate12 depot)
   added: (crate-at-space crate12 carrier1 space3)
   goals met: 5 of 23
19. (move-carrier depot loc1 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   goals met: 4 of 23
20. (pick-and-drop crate21 loc1 drone1 carrier1 space4 person5 medicine)
   deleted: (crate-at-space crate21 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person5 medicine)
   goals met: 5 of 23
21. (move-carrier loc1 depot drone1 carrier1)
   deleted: (drone-at drone1 loc1) (carrier-at carrier1 loc1)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 23
22. (put-crate-in-carrier crate20 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate20 depot)
   added: (crate-at-space crate20 carrier1 space4)
   goals met: 6 of 23
23. (put-crate-in-carrier crate19 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate19 depot)
   added: (crate-at-space crate19 carrier1 space2)
   goals met: 6 of 23
24. (move-carrier depot loc19 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   goals met: 5 of 23
25. (pick-and-drop crate19 loc19 drone1 carrier1 space2 person15 medicine)
   deleted: (crate-at-space crate19 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person15 medicine)
   goals met: 6 of 23
26. (pick-and-drop crate12 loc19 drone1 carrier1 space3 person3 food)
   deleted: (crate-at-space crate12 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person3 food)
   goals met: 7 of 23
27. (move-carrier loc19 depot drone1 carrier1)
   deleted: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 23
28. (put-crate-in-carrier crate11 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate11 depot)
   added: (crate-at-space crate11 carrier1 space3)
   goals met: 8 of 23
29. (move-carrier depot loc19 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   goals met: 7 of 23
30. (pick-and-drop crate11 loc19 drone1 carrier1 space3 person15 food)
   deleted: (crate-at-space crate11 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person15 food)
   goals met: 8 of 23
31. (move-carrier loc19 depot drone1 carrier1)
   deleted: (drone-at drone1 loc19) (carrier-at carrier1 loc19)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 23
32. (put-crate-in-carrier crate10 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate10 depot)
   added: (crate-at-space crate10 carrier1 space3)
   goals met: 9 of 23
33. (put-crate-in-carrier crate18 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate18 depot)
   added: (crate-at-space crate18 carrier1 space2)
   goals met: 9 of 23
34. (move-carrier depot loc18 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   goals met: 8 of 23
35. (pick-and-drop crate18 loc18 drone1 carrier1 space2 person12 medicine)
   deleted: (crate-at-space crate18 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person12 medicine)
   goals met: 9 of 23
36. (pick-and-drop crate10 loc18 drone1 carrier1 space3 person12 food)
   deleted: (crate-at-space crate10 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person12 food)
   goals met: 10 of 23
37. (move-carrier loc18 depot drone1 carrier1)
   deleted: (drone-at drone1 loc18) (carrier-at carrier1 loc18)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 11 of 23
38. (put-crate-in-carrier crate9 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate9 depot)
   added: (crate-at-space crate9 carrier1 space3)
   goals met: 11 of 23
39. (put-crate-in-carrier crate17 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate17 depot)
   added: (crate-at-space crate17 carrier1 space2)
   goals met: 11 of 23
40. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 10 of 23
41. (pick-and-drop crate17 loc13 drone1 carrier1 space2 person9 medicine)
   deleted: (crate-at-space crate17 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person9 medicine)
   goals met: 11 of 23
42. (pick-and-drop crate9 loc13 drone1 carrier1 space3 person9 food)
   deleted: (crate-at-space crate9 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person9 food)
   goals met: 12 of 23
43. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 13 of 23
44. (put-crate-in-carrier crate8 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate8 depot)
   added: (crate-at-space crate8 carrier1 space3)
   goals met: 13 of 23
45. (put-crate-in-carrier crate16 depot drone1 carrier1 space2)
   deleted: (empty-space carrier1 space2) (crate-at crate16 depot)
   added: (crate-at-space crate16 carrier1 space2)
   goals met: 13 of 23
46. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 12 of 23
47. (pick-and-drop crate16 loc10 drone1 carrier1 space2 person10 medicine)
   deleted: (crate-at-space crate16 carrier1 space2)
   added: (empty-space carrier1 space2) (has-content-person person10 medicine)
   goals met: 13 of 23
48. (move-carrier loc10 loc9 drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 13 of 23
49. (pick-and-drop crate20 loc9 drone1 carrier1 space4 person2 medicine)
   deleted: (crate-at-space crate20 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person2 medicine)
   goals met: 14 of 23
50. (pick-and-drop crate8 loc9 drone1 carrier1 space3 person7 food)
   deleted: (crate-at-space crate8 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person7 food)
   goals met: 15 of 23
51. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 16 of 23
52. (put-crate-in-carrier crate7 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate7 depot)
   added: (crate-at-space crate7 carrier1 space4)
   goals met: 16 of 23
53. (move-carrier depot loc9 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   goals met: 15 of 23
54. (pick-and-drop crate7 loc9 drone1 carrier1 space4 person19 food)
   deleted: (crate-at-space crate7 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person19 food)
   goals met: 16 of 23
55. (move-carrier loc9 depot drone1 carrier1)
   deleted: (drone-at drone1 loc9) (carrier-at carrier1 loc9)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 17 of 23
56. (put-crate-in-carrier crate6 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate6 depot)
   added: (crate-at-space crate6 carrier1 space4)
   goals met: 17 of 23
57. (put-crate-in-carrier crate5 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate5 depot)
   added: (crate-at-space crate5 carrier1 space3)
   goals met: 17 of 23
58. (move-carrier depot loc16 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc16) (carrier-at carrier1 loc16)
   goals met: 16 of 23
59. (pick-and-drop crate5 loc16 drone1 carrier1 space3 person8 food)
   deleted: (crate-at-space crate5 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person8 food)
   goals met: 17 of 23
60. (pick-and-drop crate6 loc16 drone1 carrier1 space4 person21 food)
   deleted: (crate-at-space crate6 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person21 food)
   goals met: 18 of 23
61. (move-carrier loc16 depot drone1 carrier1)
   deleted: (drone-at drone1 loc16) (carrier-at carrier1 loc16)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 19 of 23
62. (put-crate-in-carrier crate4 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate4 depot)
   added: (crate-at-space crate4 carrier1 space4)
   goals met: 19 of 23
63. (put-crate-in-carrier crate3 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate3 depot)
   added: (crate-at-space crate3 carrier1 space3)
   goals met: 19 of 23
64. (move-carrier depot loc13 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   goals met: 18 of 23
65. (pick-and-drop crate3 loc13 drone1 carrier1 space3 person14 food)
   deleted: (crate-at-space crate3 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person14 food)
   goals met: 19 of 23
66. (pick-and-drop crate4 loc13 drone1 carrier1 space4 person22 food)
   deleted: (crate-at-space crate4 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person22 food)
   goals met: 20 of 23
67. (move-carrier loc13 depot drone1 carrier1)
   deleted: (drone-at drone1 loc13) (carrier-at carrier1 loc13)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 21 of 23
68. (put-crate-in-carrier crate2 depot drone1 carrier1 space4)
   deleted: (empty-space carrier1 space4) (crate-at crate2 depot)
   added: (crate-at-space crate2 carrier1 space4)
   goals met: 21 of 23
69. (put-crate-in-carrier crate1 depot drone1 carrier1 space3)
   deleted: (empty-space carrier1 space3) (crate-at crate1 depot)
   added: (crate-at-space crate1 carrier1 space3)
   goals met: 21 of 23
70. (move-carrier depot loc10 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   goals met: 20 of 23
71. (pick-and-drop crate1 loc10 drone1 carrier1 space3 person10 food)
   deleted: (crate-at-space crate1 carrier1 space3)
   added: (empty-space carrier1 space3) (has-content-person person10 food)
   goals met: 21 of 23
72. (pick-and-drop crate2 loc10 drone1 carrier1 space4 person18 food)
   deleted: (crate-at-space crate2 carrier1 space4)
   added: (empty-space carrier1 space4) (has-content-person person18 food)
   goals met: 22 of 23
73. (move-carrier loc10 depot drone1 carrier1)
   deleted: (drone-at drone1 loc10) (carrier-at carrier1 loc10)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 23 of 23
